import pandas as pd
import os
import psycopg2
from dotenv import load_dotenv


mv_mapping = {
    "1": "أمهات التفاسير",
    "2": "تفاسير أهل السنة",
    "3": "تفاسير أهل السنة الصوفية",
    "9": "تفاسير ميسرة",
    "4": "تفاسير الشيعة الإثنى عشرية",
    "5": "تفاسيرالزيدية",
    "6": "تفاسيرالاباضية",
    "7": "تفاسير حديثة",
    "8": "تفاسير مختصرة",
}

tv_mapping = {
    ("1", "1"): "جامع البيان في تفسير القرآن/ الطبري (ت 310 هـ)",
    ("1", "2"): "الكشاف/ الزمخشري (ت 538 هـ)",
    ("1", "4"): "مفاتيح الغيب ، التفسير الكبير/ الرازي (ت 606 هـ)",
    ("1", "5"): "الجامع لاحكام القرآن/ القرطبي (ت 671 هـ)",
    ("1", "7"): "تفسير القرآن العظيم/ ابن كثير (ت 774 هـ)",
    ("1", "6"): "انوار التنزيل واسرار التأويل/ البيضاوي (ت 685 هـ)",
    ("1", "8"): "تفسير الجلالين/ المحلي و السيوطي (ت المحلي 864 هـ)",
    ("1", "9"): "فتح القدير/ الشوكاني (ت 1250 هـ)",
    ("2", "10"): "تفسير القرآن/ الفيروز آبادي (ت817 هـ)",
    ("2", "11"): "بحر العلوم/ السمرقندي (ت 375 هـ)",
    ("2", "12"): "النكت والعيون/ الماوردي (ت 450 هـ)",
    ("2", "13"): "معالم التنزيل/ البغوي (ت 516 هـ)",
    ("2", "14"): "المحرر الوجيز في تفسير الكتاب العزيز/ ابن عطية (ت 546 هـ)",
    ("2", "15"): "زاد المسير في علم التفسير/ ابن الجوزي (ت 597 هـ)",
    ("2", "16"): "تفسير القرآن/ ابن عبد السلام (ت 660 هـ)",
    ("2", "17"): "مدارك التنزيل وحقائق التأويل/ النسفي (ت 710 هـ)",
    ("2", "18"): "لباب التأويل في معاني التنزيل/ الخازن (ت 725 هـ)",
    ("2", "19"): "البحر المحيط/ ابو حيان (ت 754 هـ)",
    ("2", "20"): "التفسير/ ابن عرفة (ت 803 هـ)",
    ("2", "22"): "غرائب القرآن و رغائب الفرقان/القمي النيسابوري (ت 728 هـ)",
    ("2", "23"): "الجواهر الحسان في تفسير القرآن/ الثعالبي (ت 875 هـ)",
    ("2", "24"): "اللباب في علوم الكتاب/ ابن عادل (ت 880 هـ)",
    ("2", "25"): "نظم الدرر في تناسب الآيات والسور/ البقاعي (ت 885 هـ)",
    ("2", "26"): "الدر المنثور في التفسير بالمأثور/ السيوطي (ت 911 هـ)",
    ("2", "28"): "إرشاد العقل السليم إلى مزايا الكتاب الكريم/ ابو السعود (ت 951 هـ)",
    ("2", "67"): "مقاتل بن سليمان/ مقاتل بن سليمان (ت 150 هـ)",
    ("2", "75"): "الكشف والبيان / الثعلبي (ت 427 هـ)",
    ("2", "78"): "تفسير مجاهد / مجاهد بن جبر المخزومي (ت 104 هـ)",
    ("2", "79"): "الدر المصون/السمين الحلبي (ت 756 هـ)",
    ("2", "88"): "التسهيل لعلوم التنزيل / ابن جزي الغرناطي (ت 741 هـ)",
    ("2", "91"): "التفسير الكبير / للإمام الطبراني (ت 360 هـ)",
    ("2", "94"): "تأويلات أهل السنة/ الماتريدي (ت 333هـ)",
    ("2", "96"): "حاشية الصاوي / تفسير الجلالين (ت1241هـ)",
    (
        "2",
        "99",
    ): "تفسير سفيان الثوري/ عبد الله سفيان بن سعيد بن مسروق الثوري الكوفي (ت161هـ)",
    ("2", "100"): "تفسير النسائي/ النسائي (ت 303 هـ)",
    ("2", "101"): "تفسير عبد الرزاق الصنعاني مصور /همام الصنعاني (ت 211 هـ)",
    ("2", "102"): "محاسن التأويل / محمد جمال الدين القاسمي (ت 1332هـ)",
    ("2", "103"): "تفسير المنار / محمد رشيد بن علي رضا (ت 1354هـ)",
    ("2", "104"): "تفسير القرآن العزيز/ ابن أبي زمنين (ت  399هـ)",
    ("2", "105"): "كتاب نزهة القلوب/ أبى بكر السجستاني (ت 330هـ)",
    (
        "2",
        "111",
    ): "رموز الكنوز في تفسير الكتاب العزيز/ عز الدين عبد الرازق الرسعني الحنبلي (ت 661هـ)",
    ("3", "29"): "تفسير القرآن/ التستري (ت 283 هـ)",
    ("3", "30"): "حقائق التفسير/ السلمي (ت 412 هـ)",
    ("3", "31"): "لطائف الإشارات / القشيري (ت 465 هـ)",
    ("3", "32"): "عرائس البيان في حقائق القرآن/ البقلي (ت 606 هـ)",
    ("3", "33"): "تفسير القرآن / ابن عربي (ت 638 هـ)",
    ("3", "36"): "روح البيان في تفسير القرآن/ اسماعيل حقي (ت 1127 هـ)",
    ("3", "37"): "البحر المديد في تفسير القرآن المجيد/ ابن عجيبة (ت 1224 هـ)",
    ("3", "92"): "تفسير الهدايه إلى بلوغ النهايه/ مكي بن أبي طالب (ت 437 هـ)",
    ("3", "95"): "تفسير الجيلاني/ الجيلاني (ت713هـ)",
    (
        "3",
        "97",
    ): "التأويلات النجمية في التفسير الإشاري الصوفي/ الإمام أحمد بن عمر (ت618 هـ)",
    ("9", "50"): "تيسير التفسير/ اطفيش (ت 1332 هـ)",
    ("9", "68"): "تيسير التفسير/ القطان (ت 1404 هـ)",
    ("9", "65"): "المنتخب في تفسير القرآن الكريم / لجنة القرآن و السنة ",
    ("9", "71"): "أيسر التفاسير/ د. أسعد حومد (ت 2011م)",
    ("9", "85"): "تفسير آيات الأحكام/ الصابوني (مـ 1930م -)",
    ("9", "84"): "مختصر تفسير ابن كثير/ الصابوني (مـ 1930م -)",
    ("9", "83"): "صفوة التفاسير/ الصابوني (مـ 1930م -)",
    ("4", "3"): "مجمع البيان في تفسير القرآن/ الطبرسي (ت 548 هـ)",
    ("4", "38"): "تفسير القرآن/ علي بن ابراهيم القمي (ت القرن 4 هـ)",
    ("4", "39"): "التبيان الجامع لعلوم القرآن/ الطوسي (ت 460 هـ)",
    ("4", "56"): "الميزان في تفسير القرآن/ الطبطبائي (ت 1401 هـ)",
    ("4", "41"): "الصافي في تفسير كلام الله الوافي/ الفيض الكاشاني (ت 1090 هـ)",
    ("4", "42"): "تفسير بيان السعادة في مقامات العبادة/ الجنابذي (ت القرن 14  هـ)",
    ("4", "40"): "تفسير صدر المتألهين/ صدر المتألهين الشيرازي (ت 1059 هـ)",
    ("4", "110"): "البرهان في تفسير القرآن/ هاشم الحسيني البحراني (ت 1107هـ)",
    ("5", "44"): "تفسير الحبري/ الحبري (ت 286 هـ)",
    ("5", "45"): "تفسير فرات الكوفي/ فرات الكوفي (ت القرن 3 هـ)",
    ("5", "47"): "تفسير الأعقم/ الأعقم (ت القرن 9 هـ)",
    ("5", "89"): "غريب القرآن / زيد بن علي (ت 120 هـ)",
    ("6", "48"): "تفسير كتاب الله العزيز/ الهواري (ت القرن 3 هـ)",
    ("6", "49"): "هميان الزاد إلى دار المعاد / اطفيش (ت 1332 هـ)",
    ("6", "51"): "جواهر التفسير/ الخليلي (مـ 1942م- )",
    ("7", "52"): "روح المعاني/ الالوسي (ت 1270 هـ)",
    ("7", "54"): "التحرير والتنوير/ ابن عاشور (ت 1393 هـ)",
    ("7", "55"): "أضواء البيان في تفسير القرآن/ الشنقيطي (ت 1393 هـ)",
    ("7", "76"): "خواطر محمد متولي الشعراوي (ت 1419 هـ)",
    ("7", "57"): "الوسيط في تفسير القرآن الكريم/ طنطاوي (ت 1431 هـ)",
    ("8", "60"): "الوجيز/ الواحدي (ت 468 هـ)",
    ("8", "90"): "النهر الماد / الأندلسي (ت 754 هـ)",
    (
        "8",
        "106",
    ): "تذكرة الاريب في تفسير الغريب/ الامام ابي الفرج ابن الجوزي (ت 597 هـ)",
    ("8", "112"): "الصراط المستقيم في تبيان القرآن الكريم / تفسير الكازروني (ت 923هـ)",
}


def main():

    load_dotenv()
    db_name = os.getenv("DB_NAME")
    db_user = os.getenv("DB_USER")
    db_password = os.getenv("DB_PASSWORD")
    db_host = os.getenv("DB_HOST")
    db_port = os.getenv("DB_PORT")
    # connect to the database
    connection = psycopg2.connect(
        dbname=db_name,
        user=db_user,
        password=db_password,
        host=db_host,
        port=db_port,
    )
    cursor = connection.cursor()
    # execute SQL in db/tables.sql to create the database and tables if not created
    with open("db/tables.sql", "r") as f:
        sql = f.read()

    cursor.execute(sql)
    connection.commit()
    df = pd.read_csv("data/quran.csv")

    query = """
    INSERT INTO Sentence (sentence_id, section_id, paragraph_id, text)
    VALUES (%s, %s, %s, %s)
    """

    for i, row in df.iterrows():
        row["aya"] = int(row["aya"])
        row["sura"] = int(row["sura"])
        cursor.execute(query, (row["aya"], row["sura"], None, row["text"]))

    dfs = []
    for dir in os.listdir("data"):
        if not dir.startswith("tafseer"):
            continue
        dir = os.path.join("data", dir)
        for file in os.listdir(dir):
            file = os.path.join(dir, file)
            dfs.append(pd.read_csv(file))

    df = pd.concat(dfs, ignore_index=True)
    for _, row in df.iterrows():
        row["ID"] = row["tafsir_id"]
        mv, tv, soura, aya, size = row["tafsir_id"].split("_")
        aya = int(aya)
        size = int(size)
        soura = int(soura)
        source = tv_mapping.get((mv, tv), None)
        txt = ""
        texts: list[str] = row["text"].split("<>")
        for i, text in enumerate(texts):
            if txt:
                text = txt + " " + text
                txt = ""
            if len(text.split()) < 30 and i + 1 != len(texts):
                txt = text
                continue
            id = row["ID"] + f"_{i}"
            query = """
            INSERT INTO Related_text (related_id, details, source)
            VALUES (%s, %s, %s)
            """
            cursor.execute(query, (id, text, source))
            query = """
            INSERT INTO relationship (sentence_id, section_id, related_text_id)
            VALUES (%s, %s, %s)"""
            for j in range(int(size)):
                cursor.execute(query, (aya + j, soura, id))
    connection.commit()
