import { Step } from "../util/types";

// this is used to populate the guide modal in the navbar
export const steps: Step[] = [  
    {
      title: "مرحباً بك في محادثة التفسير",
      text: "سوف يوضح لك هذا الدليل كيفية استخدام الموقع.",
    },
    {
      title: "الخطوة ١: اختر المصدر",
      text: "اختر المصدر المراد أن يعتمد عليه البحث.",
      image: "../../assets/guide/step1.gif",
    },
    {
      title: "الخطوة ٢: اختر نوعية الاجابة",
      text: "اختيار البيانات الاصلية يؤدي الى عرض المعلومات الاكثر تعلقا بالسؤال كما هي من منقولة من مصادرها، اما تفعيل الرد الذكي يعرض الاجابة على ادوات الذكاء الاصطناعي لنتائج اكثر انسيابية وذكية.",
      image: "../../assets/guide/step2.gif",
    },
    {
      title: "الخطوة ٣: اكتب سؤالك",
      text: "استخدم المساحة المخصصة لطرح السؤال وتلقي الاجابة.",
      image: "../../assets/guide/step3.gif",
    },
    {
      title: "الخطوة ٤: عرض الاجابة",
      text: "بعد طرح السؤال، سيقوم المساعد بعرض الاجابة بعد اجراء التحاليل في خانة الاجابة.",
      image: "../../assets/guide/step4.gif",
    },
  ];